app/services/fixture_importer.rb

SELECT "teams".* FROM "teams" WHERE "teams"."tournament_id" = 1 AND "teams"."code" = 'ARG' LIMIT 1
INSERT INTO "teams" ("code", "created_at", "flag", "group", "name", "tournament_id", "updated_at") VALUES ('ARG', '2026-06-03 14:58:22.861515', '🇦🇷', 'A', 'Argentina', 1, '2026-06-03 14:58:22.861515') RETURNING "id"
---
  def import_teams
    CSV.parse(@teams_csv, headers: true).each_with_index do |row, i|
      team = @tournament.teams.find_or_initialize_by(code: row["code"])
      team.assign_attributes(name: row["name"], flag: row["flag"], group: row["group"])
      team.save!
    rescue => e
      @errors << "teams.csv fila #{i + 2}: #{e.message}"

SELECT "teams".* FROM "teams" WHERE "teams"."tournament_id" = 1
SELECT "matches".* FROM "matches" WHERE "matches"."tournament_id" = 1 AND "matches"."stage" = 'group' AND "matches"."home_team_id" = 1 AND "matches"."away_team_id" = 2 LIMIT 1
INSERT INTO "matches" ("away_label", "away_score", "away_team_id", "created_at", "group", "home_label", "home_score", "home_team_id", "kickoff_at", "slot", "stage", "status", "tournament_id", "updated_at") VALUES (NULL, NULL, 2, '2026-06-03 14:58:22.868934', 'A', NULL, NULL, 1, '2026-06-11 19:00:00', NULL, 'group', 'scheduled', 1, '2026-06-03 14:58:22.868934') RETURNING "id"
---
  def import_matches
    by_code = @tournament.teams.index_by(&:code)
    CSV.parse(@matches_csv, headers: true).each_with_index do |row, i|
      home = by_code[row["home_code"]]
      away = by_code[row["away_code"]]
      unless home && away
        @errors << "group_matches.csv fila #{i + 2}: código desconocido (#{row["home_code"]} / #{row["away_code"]})"
        next
      end
      match = @tournament.matches.find_or_initialize_by(stage: "group", home_team: home, away_team: away)
      match.assign_attributes(group: row["group"], kickoff_at: Time.zone.parse(row["kickoff_at"]))
      match.save!
    rescue => e
      @errors << "group_matches.csv fila #{i + 2}: #{e.message}"