app/services/knockout_bracket_builder.rb

  def build
    ROUNDS.each do |stage, (count, prefix, date)|
      (1..count).each do |slot|
        match = @tournament.matches.find_or_initialize_by(stage: stage, slot: slot)
---
SELECT "matches".* FROM "matches" WHERE "matches"."tournament_id" = 1 AND "matches"."stage" = 'round_of_32' AND "matches"."slot" = 1 LIMIT 1