app/services/scoring_service.rb

SELECT "matches".* FROM "matches" WHERE "matches"."tournament_id" = 1 AND "matches"."status" = 'finished'
SELECT "players".* FROM "players" WHERE "players"."id" IN (4, 5, 6, 7, 3)
SELECT "predictions".* FROM "predictions" WHERE "predictions"."match_id" IN (1, 2, 3)
---
  def self.standings(tournament)
    finished = tournament.matches.where(status: "finished").to_a
    by_match = finished.index_by(&:id)

    totals = Hash.new(0)
    Prediction.where(match_id: by_match.keys).includes(:player).each do |pred|