lib/tasks/golbet.rake

INSERT INTO "tournaments" ("created_at", "name", "updated_at") VALUES ('2026-06-03 14:58:22.846880', 'Mundial 2026', '2026-06-03 14:58:22.846880') RETURNING "id"
SELECT "tournaments".* FROM "tournaments" ORDER BY "tournaments"."id" ASC LIMIT 1
SELECT COUNT(*) FROM "matches" WHERE "matches"."tournament_id" = 1 AND "matches"."stage" != 'group'
---
  task load_fixtures: :environment do
    tournament = Tournament.first_or_create!(name: "Mundial 2026")
    Pool.find_or_create_by!(public: true) { |p| p.tournament = tournament; p.name = "Mundial — General" }
    teams_csv = File.read(Rails.root.join("db/fixtures/teams.csv"))
    matches_csv = File.read(Rails.root.join("db/fixtures/group_matches.csv"))

    result = FixtureImporter.new(tournament, teams_csv: teams_csv, matches_csv: matches_csv).import
    KnockoutBracketBuilder.new(tournament).build

    if result.success?
      puts "OK: #{tournament.teams.count} teams, #{tournament.matches.count} matches " \
           "(#{tournament.matches.where(stage: 'group').count} group + " \
           "#{tournament.matches.where.not(stage: 'group').count} knockout)."