app/controllers/admin/matches_controller.rb

    def index
      @tournament = Tournament.first_or_create!(name: "Torneo")
---
INSERT INTO "tournaments" ("created_at", "name", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["created_at", "2026-06-03 16:28:46.397501"], ["name", "Mundial 2026"], ["updated_at", "2026-06-03 16:28:46.397501"]]
SELECT "tournaments".* FROM "tournaments" ORDER BY "tournaments"."id" ASC LIMIT ?  [["LIMIT", 1]]

    def create
      tournament = Tournament.first_or_create!(name: "Torneo")
      match = tournament.matches.new(match_params)
      if match.save
---
INSERT INTO "tournaments" ("created_at", "name", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["created_at", "2026-06-02 12:38:09.825105"], ["name", "Torneo"], ["updated_at", "2026-06-02 12:38:09.825105"]]
SELECT "tournaments".* FROM "tournaments" ORDER BY "tournaments"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "matches" ("away_score", "away_team", "created_at", "home_score", "home_team", "kickoff_at", "status", "tournament_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

    def edit
      render Views::Admin::Matches::Form.new(match: Match.find(params[:id]))
---
SELECT "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
      match = Match.find(params[:id])
      if match.update(match_params)
---
SELECT "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "matches" SET "away_team_id" = ?, "home_team_id" = ?, "updated_at" = ? WHERE "matches"."id" = ?  [["away_team_id", 2], ["home_team_id", 1], ["updated_at", "2026-06-03 15:14:28.240949"], ["id", 1]]