app/controllers/admin/matches_controller.rb

      scope = @tournament.matches.includes(:home_team, :away_team).order(:kickoff_at)
---
SELECT "matches".* FROM "matches" WHERE "matches"."tournament_id" = ? ORDER BY "matches"."kickoff_at" ASC  [["tournament_id", 980190963]]