app/controllers/admin/results_controller.rb

INSERT INTO "tournaments" ("created_at", "name", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["created_at", "2026-06-02 12:38:38.542451"], ["name", "Torneo"], ["updated_at", "2026-06-02 12:38:38.542451"]]
SELECT "tournaments".* FROM "tournaments" ORDER BY "tournaments"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "matches".* FROM "matches" WHERE "matches"."tournament_id" = ? ORDER BY "matches"."kickoff_at" ASC  [["tournament_id", 980190963]]
---
    def index
      tournament = Tournament.first_or_create!(name: "Torneo")
      render Views::Admin::Results::Index.new(matches: tournament.matches.order(:kickoff_at))

SELECT "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT ?  [["id", 980190963], ["LIMIT", 1]]
UPDATE "matches" SET "away_score" = ?, "home_score" = ?, "status" = ?, "updated_at" = ? WHERE "matches"."id" = ?  [["away_score", 1], ["home_score", 2], ["status", "finished"], ["updated_at", "2026-06-02 12:38:38.516965"], ["id", 980190963]]
---
    def update
      match = Match.find(params[:id])
      match.assign_attributes(home_score: params[:home_score], away_score: params[:away_score], status: "finished")
      if match.save