app/controllers/application_controller.rb

SELECT "players".* FROM "players" WHERE "players"."session_token" = '07f4952d9b5a9f4d172344c2818f5e7f' LIMIT 1
---
  def current_player
    return @current_player if defined?(@current_player)
    @current_player = Player.find_by(session_token: cookies.signed[:player_token])