app/controllers/groups_controller.rb

SELECT "tournaments".* FROM "tournaments" ORDER BY "tournaments"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    tournament = Tournament.first