app/controllers/predictions_controller.rb

  def index
    @tournament = Tournament.first
    matches = @tournament ? @tournament.matches.includes(:home_team, :away_team).order(:kickoff_at) : []
    grouped = matches.group_by(&:stage)
                     .sort_by { |stage, _| Match::STAGES.index(stage) }
                     .to_h
                     .transform_keys { |s| STAGE_LABELS[s] || s }
    special = @tournament && current_player.special_predictions.find_or_initialize_by(tournament: @tournament)
---
SELECT "tournaments".* FROM "tournaments" ORDER BY "tournaments"."id" ASC LIMIT 1
SELECT "matches".* FROM "matches" WHERE "matches"."tournament_id" = ? ORDER BY "matches"."kickoff_at" ASC  [["tournament_id", 298486374]]
SELECT "teams".* FROM "teams" WHERE "teams"."id" IN (?, ?)  [["id", 1], ["id", 2]]
SELECT "matches".* FROM "matches" WHERE "matches"."tournament_id" = ? AND "matches"."stage" = ? AND "matches"."home_team_id" = ? AND "matches"."away_team_id" = ? LIMIT ?  [["tournament_id", 1], ["stage", "group"], ["home_team_id", 1], ["away_team_id", 2], ["LIMIT", 1]]
SELECT "predictions".* FROM "predictions" WHERE "predictions"."player_id" = 1

  def create
    match = Match.find(params[:match_id])
    prediction = current_player.predictions.find_or_initialize_by(match: match, pool: current_pool)
    prediction.assign_attributes(home_pred: params[:home_pred], away_pred: params[:away_pred])

    if prediction.save
---
SELECT "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT ?  [["id", 980190963], ["LIMIT", 1]]
SELECT "predictions".* FROM "predictions" WHERE "predictions"."player_id" = ? AND "predictions"."match_id" = ? LIMIT ?  [["player_id", 1], ["match_id", 980190963], ["LIMIT", 1]]
UPDATE "predictions" SET "away_pred" = ?, "home_pred" = ?, "updated_at" = ? WHERE "predictions"."id" = ?  [["away_pred", 0], ["home_pred", 3], ["updated_at", "2026-06-02 12:20:36.591041"], ["id", 1]]