app/controllers/results_controller.rb

SELECT "tournaments".* FROM "tournaments" ORDER BY "tournaments"."id" ASC LIMIT 1
SELECT "matches".* FROM "matches" WHERE "matches"."tournament_id" = ? AND "matches"."status" = ? ORDER BY "matches"."kickoff_at" DESC  [["tournament_id", 980190963], ["status", "finished"]]
SELECT "matches".* FROM "matches" WHERE "matches"."tournament_id" = 1 AND "matches"."status" = 'finished' ORDER BY "matches"."kickoff_at" DESC
---
  def index
    tournament = Tournament.first
    matches = tournament ? tournament.matches.where(status: "finished").order(kickoff_at: :desc) : []
    my_preds = current_player.predictions.index_by(&:match_id)
    rows = matches.map do |m|