app/controllers/sessions_controller.rb

  def create
    player = Player.new(name: params[:name])
    if player.save
---
INSERT INTO "players" ("created_at", "name", "session_token", "updated_at") VALUES ('2026-06-02 16:28:27.361824', 'oscar', '07f4952d9b5a9f4d172344c2818f5e7f', '2026-06-02 16:28:27.361824') RETURNING "id"