app/controllers/standings_controller.rb

  def index
    tournament = Tournament.first
---
SELECT "tournaments".* FROM "tournaments" ORDER BY "tournaments"."id" ASC LIMIT 1